case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  BirdCarreau;

nu              nu [ 0 2 -1 0 0 0 0 ] 3.02e-06;
rho		rho [1 -3 0 0 0 0 0] 1060;

BirdCarreauCoeffs
{
    nu0				nu0 [0 2 -1 0 0 0 0] 6.98e-5;
    nuInf			nuInf [0 2 -1 0 0 0 0] 3.71e-6;
    k				k [0 0 1 0 0 0 0] 9.1034;
    n				n [0 0 0 0 0 0 0] 0.4586;
}


// ************************************************************************* //
